InformationRegisters/ЦеныПродажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<InformationRegister>
		<Properties>
			<Name>ЦеныПродажи</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена0</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена1</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Порог1</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПорогЦен</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена2</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Порог2</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПорогЦен</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена3</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Порог3</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПорогЦен</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазрешитьПродажу</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/StockAPI_Цены/Ext/Module.bsl
// Цены StockAPI: вид цены, загрузка из регистра, проверка при создании/изменении заказа.

// Разбор строки вида цены: МелкийОпт (по умолчанию) или КрупныйОпт.
Функция ВидЦеныИзПараметра(СтрокаВидаЦены) Экспорт
	
	Если СтрокаВидаЦены = Неопределено Или СокрЛП(СтрокаВидаЦены) = "" Тогда
		Возврат Справочники.ВидыЦен.МелкийОпт;
	КонецЕсли;
	
	Норм = ВРег(СокрЛП(СтрокаВидаЦены));
	
	Если Норм = "КРУПНЫЙОПТ" Или Норм = "LARGE" Или Норм = "WHOLESALE" Тогда
		Возврат Справочники.ВидыЦен.КрупныйОпт;
	КонецЕсли;
	
	Возврат Справочники.ВидыЦен.МелкийОпт;
	
КонецФункции

// Уникальные позиции номенклатуры из таблицы остатков (для передачи в ЗагрузитьЦеныПродажи).
Функция УникальнаяНоменклатураИзТаблицы(ТаблицаОстатков) Экспорт
	
	Уникальные = Новый Соответствие;
	МассивНоменклатуры = Новый Массив;
	
	Для Каждого Стр Из ТаблицаОстатков Цикл
		Если ЗначениеЗаполнено(Стр.Номенклатура) И Уникальные.Получить(Стр.Номенклатура) = Неопределено Тогда
			Уникальные.Вставить(Стр.Номенклатура, Истина);
			МассивНоменклатуры.Добавить(Стр.Номенклатура);
		КонецЕсли;
	КонецЦикла;
	
	Возврат МассивНоменклатуры;
	
КонецФункции

// Загружает цены продажи из регистра ЦеныПродажи на заданную дату.
// Возвращает Соответствие: Номенклатура → {Цена, ЦенаОтКоличества, КоличествоПорог, Валюта}.
Функция ЗагрузитьЦеныПродажи(МассивНоменклатуры, ВидЦены) Экспорт
	
	Результат = Новый Соответствие;
	
	Если МассивНоменклатуры.Количество() = 0 Тогда
		Возврат Результат;
	КонецЕсли;
	
	Зап = Новый Запрос;
	Зап.Текст = "ВЫБРАТЬ
	            |	Цены.Номенклатура КАК Номенклатура,
	            |	Цены.Цена0 КАК Цена0,
	            |	Цены.Цена1 КАК Цена1,
	            |	Цены.Цена2 КАК Цена2,
	            |	Цены.Цена3 КАК Цена3,
	            |	Цены.Порог1 КАК Порог1,
	            |	Цены.Порог2 КАК Порог2,
	            |	Цены.Порог3 КАК Порог3,
	            |	Цены.РазрешитьПродажу КАК РазрешитьПродажу,
	            |	Цены.ВидЦены.Валюта.Наименование КАК Валюта
	            |ИЗ
	            |	РегистрСведений.ЦеныПродажи.СрезПоследних(
	            |			,
	            |			Номенклатура В (&Номенклатура)
	            |				И ВидЦены = &ВидЦены) КАК Цены";
	Зап.УстановитьПараметр("Номенклатура", МассивНоменклатуры);
	Зап.УстановитьПараметр("ВидЦены", ВидЦены);
	
	Выборка = Зап.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтруктураЗаписи = Новый Структура("Цена0,Цена1,Цена2,Цена3,Порог1,Порог2,Порог3,РазрешитьПродажу,Валюта");   
		ЗаполнитьЗначенияСвойств(СтруктураЗаписи, Выборка);
		Результат.Вставить(Выборка.Номенклатура, СтруктураЗаписи);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Загружает цены МелкийОпт и КрупныйОпт.
// Возвращает Соответствие: Номенклатура → Соответствие(ВидЦены → данные цены).
Функция ЗагрузитьЦеныПродажиВсехВидов(МассивНоменклатуры) Экспорт
	
	Результат = Новый Соответствие;
	
	Если МассивНоменклатуры.Количество() = 0 Тогда
		Возврат Результат;
	КонецЕсли;
	
	ВидыЦен = Новый Массив;
	ВидыЦен.Добавить(Справочники.ВидыЦен.МелкийОпт);
	ВидыЦен.Добавить(Справочники.ВидыЦен.КрупныйОпт);
	
	Зап = Новый Запрос;
	Зап.Текст = "ВЫБРАТЬ
	            |	Цены.Номенклатура КАК Номенклатура,
	            |	Цены.ВидЦены КАК ВидЦены,
	            |	Цены.Цена КАК Цена,
	            |	Цены.ЦенаОтКоличества КАК ЦенаОтКоличества,
	            |	Цены.Количество КАК КоличествоПорог,
	            |	Цены.ВидЦены.Валюта.Наименование КАК Валюта
	            |ИЗ
	            |	РегистрСведений.ЦеныПродажи.СрезПоследних(
	            |			,
	            |			Номенклатура В (&Номенклатура)
	            |				И ВидЦены В (&ВидыЦен)) КАК Цены";
	Зап.УстановитьПараметр("Номенклатура", МассивНоменклатуры);
	Зап.УстановитьПараметр("ВидыЦен", ВидыЦен);
	
	Выборка = Зап.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ЦеныНоменклатуры = Результат.Получить(Выборка.Номенклатура);
		Если ЦеныНоменклатуры = Неопределено Тогда
			ЦеныНоменклатуры = Новый Соответствие;
			Результат.Вставить(Выборка.Номенклатура, ЦеныНоменклатуры);
		КонецЕсли;
		
		ЦеныНоменклатуры.Вставить(
			Выборка.ВидЦены,
			Новый Структура("Цена, ЦенаОтКоличества, КоличествоПорог, Валюта",
				Выборка.Цена,
				Выборка.ЦенаОтКоличества,
				Выборка.КоличествоПорог,
				Выборка.Валюта));
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Извлекает цену из позиции запроса (поля price или salePrice).
Функция ЦенаИзПозицииЗапроса(Позиция) Экспорт
	
	Если Позиция.Свойство("price") Тогда
		Возврат Число(Позиция.price);
	КонецЕсли;
	
	Если Позиция.Свойство("salePrice") Тогда
		Возврат Число(Позиция.salePrice);
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции

Функция ЦеныСовпадают(ЦенаЗапроса, ОжидаемаяЦена) Экспорт
	
	Возврат Окр(ЦенаЗапроса, 2) = Окр(ОжидаемаяЦена, 2);
	
КонецФункции

// Проверяет цены строк заказа относительно регистра ЦеныПродажи.
// Возвращает СписокЗначений с текстами ошибок (пустой — всё верно).
Функция ПроверитьЦеныСтрокЗаказа(СтрокиЗаказа, ЦеныПродажи, ИмяВидаЦены) Экспорт
	
	Ошибки = Новый СписокЗначений;
	
	Для Каждого СтрЗаказа Из СтрокиЗаказа Цикл
		
		ДанныеЦены = ЦеныПродажи.Получить(СтрЗаказа.Номенклатура);
		ОжидаемаяЦена = ЦенаПродажиПоКоличеству(ДанныеЦены, СтрЗаказа.Количество);
		
		Если ОжидаемаяЦена <= 0 Тогда
			Ошибки.Добавить(СтрШаблон("Строка %1: для товара %2 не задана цена продажи (вид %3).",
				СтрЗаказа.НомерПозиции,
				Строка(СтрЗаказа.Номенклатура),
				ИмяВидаЦены));
			Продолжить;
		КонецЕсли;
		
		Если НЕ ЦеныСовпадают(СтрЗаказа.Цена, ОжидаемаяЦена) Тогда
			Ошибки.Добавить(СтрШаблон("Строка %1: неверная цена. Указано %2, ожидается %3 (salePrice, вид %4).",
				СтрЗаказа.НомерПозиции,
				Формат(СтрЗаказа.Цена, "ЧДЦ=2; ЧРД=.; ЧГ=0"),
				Формат(ОжидаемаяЦена, "ЧДЦ=2; ЧРД=.; ЧГ=0"),
				ИмяВидаЦены));
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Ошибки;
	
КонецФункции

// Определяет цену продажи с учётом порога количества.
Функция ЦенаПродажиПоКоличеству(ДанныеЦены, Количество) Экспорт
	
	Если ДанныеЦены = Неопределено Тогда
		Возврат 0;
	КонецЕсли;
	
	Если ДанныеЦены.Порог3 > 0
		И Количество >= ДанныеЦены.Порог3
		И ДанныеЦены.Цена3 > 0 Тогда
		Возврат ДанныеЦены.Цена3;
	КонецЕсли;
	Если ДанныеЦены.Порог2 > 0
		И Количество >= ДанныеЦены.Порог2
		И ДанныеЦены.Цена2 > 0 Тогда
		Возврат ДанныеЦены.Цена2;
	КонецЕсли;
	Если ДанныеЦены.Порог1 > 0
		И Количество >= ДанныеЦены.Порог1
		И ДанныеЦены.Цена1 > 0 Тогда
		Возврат ДанныеЦены.Цена1;
	КонецЕсли;
	
	Возврат ДанныеЦены.Цена0;
	
КонецФункции

//Функция ВалютаЦенПродажиПоУмолчанию()
//	
//	Валюта = Константы.ВалютаУстановкиЦенПродажи.Получить();
//	Если ЗначениеЗаполнено(Валюта) Тогда
//		Возврат Строка(Валюта);
//	КонецЕсли;
//	
//	Валюта = Константы.БазоваяВалюта.Получить();
//	Если ЗначениеЗаполнено(Валюта) Тогда
//		Возврат Строка(Валюта);
//	КонецЕсли;
//	
//	Возврат "";
//	
//КонецФункции

//Функция НаименованиеВалютыЦен(ВалютаИзРегистра)
//	
//	Если ЗначениеЗаполнено(ВалютаИзРегистра) Тогда
//		Возврат Строка(ВалютаИзРегистра);
//	КонецЕсли;
//	
//	Возврат ВалютаЦенПродажиПоУмолчанию();
//	
//КонецФункции

//// Добавляет поля salePrice, priceType, currency в структуру элемента (позиции остатка/единицы).
//Процедура ДобавитьЦенуВСтруктуру(СтруктураЭлемента, ДанныеЦены, Количество, ИмяВидаЦены) Экспорт
//	
//	СтруктураЭлемента.Вставить("salePrice", ЦенаПродажиПоКоличеству(ДанныеЦены, Количество));
//	СтруктураЭлемента.Вставить("priceType", ИмяВидаЦены);
//	
//	Валюта = "";
//	Если ДанныеЦены <> Неопределено Тогда
//		Валюта = НаименованиеВалютыЦен(ДанныеЦены.Валюта);
//	Иначе
//		Валюта = ВалютаЦенПродажиПоУмолчанию();
//	КонецЕсли;
//	СтруктураЭлемента.Вставить("currency", Валюта);
//	
//КонецПроцедуры

// Добавляет prices (все виды).
Процедура ДобавитьЦеныВСтруктуру(СтруктураЭлемента, ЦеныПоВидам, Количество, ВидЦеныПоУмолчанию) Экспорт
	
	МассивЦен = Новый Массив;
	ВидыДляОтвета = Новый Массив;
	ВидыДляОтвета.Добавить(Справочники.ВидыЦен.МелкийОпт);
	ВидыДляОтвета.Добавить(Справочники.ВидыЦен.КрупныйОпт);
	
	Если ЦеныПоВидам <> Неопределено Тогда
		Для Каждого ВидЦены Из ВидыДляОтвета Цикл
			ДанныеЦены = ЦеныПоВидам.Получить(ВидЦены);
			Если ДанныеЦены = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			ЗаписьЦены = Новый Структура;
			ЗаписьЦены.Вставить("priceType", Строка(ВидЦены));
			ЗаписьЦены.Вставить("salePrice", ЦенаПродажиПоКоличеству(ДанныеЦены, Количество));
			ЗаписьЦены.Вставить("currency", ДанныеЦены.Валюта.Наименование);
			МассивЦен.Добавить(ЗаписьЦены);
		КонецЦикла;
	КонецЕсли;
	
	СтруктураЭлемента.Вставить("prices", МассивЦен);
	
КонецПроцедуры
